tutorials/shipFoam/roll/constant/dynamicMeshDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          motionProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh dynamicMotionSolverFvMesh;

motionSolverLibs ("libfvMotionSolvers.so");

//solver laplacian;
solver velocityLaplacian;

//diffusivity  uniform;
// diffusivity  directional (1 200 0);
// diffusivity  motionDirectional (1 1000 0);
// diffusivity  inverseDistance 1(Heavy);
// diffusivity  file motionDiffusivity;
diffusivity  quadratic inverseDistance 1(Hull);
// diffusivity  exponential 2000 inverseDistance 1(Hull);

// ************************************************************************* //
